Revit 2027 API
SpacingRule.Justification Property
The justification of the lines within the region.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public SpacingRuleJustification Justification { get; set; }
Public Property Justification As SpacingRuleJustification
	Get
	Set
public:
property SpacingRuleJustification Justification {
	SpacingRuleJustification get ();
	void set (SpacingRuleJustification value);
}
member Justification : SpacingRuleJustification with get, set
Property Value
SpacingRuleJustification
Remarks
This property is only available when Layout is equal to FixedDistance, FixedNumber, MaximumSpacing, or MinimumSpacing.
See Also
Reference
SpacingRule Class
Autodesk.Revit.DB Namespace